In [3]:
from urllib.parse import quote_plus

import pandas as pd
from sqlalchemy import create_engine

username = quote_plus("root")
password = quote_plus("howdoyouturnthison")
server = "127.0.0.1:3307"
db_name = "TESTDB"

conn = create_engine(
    f"mysql+pymysql://{username}:{password}@{server}/{db_name}",
).connect()

In [4]:
sql = """
select * from Staff
where Age >= 30
"""

df = pd.read_sql(
    sql,
    conn,
)

In [5]:
df

     ID     Name DeptId  Age Gender  Salary            recordDt
0  S002      Bob   D002   35      M   60000 2024-11-24 10:30:00
1  S003  Charlie   D001   30      M   55000 2024-11-24 11:00:00
2  S005      Eve   D002   40      F   70000 2024-11-24 12:00:00

In [6]:
df["ID"].str.replace("00", "11")

0    S112
1    S113
2    S115
Name: ID, dtype: object

In [7]:
df["ID"] = df["ID"].str.replace("00", "11")

In [8]:
df

     ID     Name DeptId  Age Gender  Salary            recordDt
0  S112      Bob   D002   35      M   60000 2024-11-24 10:30:00
1  S113  Charlie   D001   30      M   55000 2024-11-24 11:00:00
2  S115      Eve   D002   40      F   70000 2024-11-24 12:00:00

In [11]:
df.to_sql(
    "Staff",  # Table name
    conn,
    "TESTDB",  # Default to database name in connection
    if_exists="append",
    index=False,
)

/var/folders/_k/k5dry95j0q5d35_9pn5d86vm0000gn/T/ipykernel_88878/216348563.py:1: FutureWarning: Starting with pandas version 3.0 all arguments of to_sql except for the arguments 'name' and 'con' will be keyword-only.
  df.to_sql(

3

In [12]:
conn.commit()